; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	thermograph1 - mode
	image0 - mode
	GroundStation2 - direction
	Star7 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star9 - direction
	GroundStation8 - direction
	Star5 - direction
	Star1 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation6)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star7)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 Star9)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 GroundStation8)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 GroundStation4)
	(calibration_target instrument10 Star5)
	(calibration_target instrument10 GroundStation8)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation4)
	(calibration_target instrument11 GroundStation6)
	(calibration_target instrument11 Star1)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star13)
)
(:goal (and
	(pointing satellite0 Phenomenon15)
	(pointing satellite2 GroundStation3)
	(pointing satellite4 Phenomenon15)
	(have_image Star10 image0)
	(have_image Planet11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Star13 thermograph1)
	(have_image Star14 thermograph1)
	(have_image Phenomenon15 thermograph1)
	(have_image Phenomenon16 thermograph1)
	(have_image Star17 image0)
))

)

; plan
1. (turn_to satellite4 phenomenon15 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 phenomenon15)
   goals met: 2 of 11
2. (turn_to satellite0 groundstation6 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 groundstation6)
   goals met: 2 of 11
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 11
4. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 2 of 11
5. (turn_to satellite0 star10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star10)
   goals met: 2 of 11
6. (take_image satellite0 star10 instrument0 image0)
   added: (have_image star10 image0)
   goals met: 3 of 11
7. (turn_to satellite0 planet11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet11)
   goals met: 3 of 11
8. (take_image satellite0 planet11 instrument0 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 4 of 11
9. (turn_to satellite0 phenomenon16 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 11
10. (take_image satellite0 phenomenon16 instrument0 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 5 of 11
11. (turn_to satellite0 phenomenon12 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 11
12. (take_image satellite0 phenomenon12 instrument0 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 6 of 11
13. (turn_to satellite0 star13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star13)
   goals met: 6 of 11
14. (take_image satellite0 star13 instrument0 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 7 of 11
15. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 7 of 11
16. (take_image satellite0 star14 instrument0 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 8 of 11
17. (turn_to satellite0 star17 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star17)
   goals met: 8 of 11
18. (take_image satellite0 star17 instrument0 image0)
   added: (have_image star17 image0)
   goals met: 9 of 11
19. (turn_to satellite0 phenomenon15 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 phenomenon15)
   goals met: 10 of 11
20. (take_image satellite0 phenomenon15 instrument0 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 11 of 11
